Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_gpio.h
/** @defgroup GPIO_LL_EC_SPEED Output Speed
  * @{
  */
#define LL_GPIO_SPEED_FREQ_LOW             (0x00000000U)          /*!< Select I/O low output speed    */
#define LL_GPIO_SPEED_FREQ_MEDIUM          GPIO_OSPEEDR_OSPEED0_0 /*!< Select I/O medium output speed */
#define LL_GPIO_SPEED_FREQ_HIGH            GPIO_OSPEEDR_OSPEED0_1 /*!< Select I/O high output speed   */
#define LL_GPIO_SPEED_FREQ_VERY_HIGH       GPIO_OSPEEDR_OSPEED0   /*!< Select I/O very high output speed   */
/**
  * @}
  */

/** @defgroup GPIO_LL_EC_PULL Pull Up Pull Down
  * @{
  */
#define LL_GPIO_PULL_NO                    (0x00000000U)      /*!< Select I/O no pull */
#define LL_GPIO_PULL_UP                    GPIO_PUPDR_PUPD0_0 /*!< Select I/O pull up */
#define LL_GPIO_PULL_DOWN                  GPIO_PUPDR_PUPD0_1 /*!< Select I/O pull down */
/**
  * @}
  */

/** @defgroup GPIO_LL_EC_AF Alternate Function
  * @{
  */
#define LL_GPIO_AF_0                       (0x0000000U) /*!< Select alternate function 0 */
#define LL_GPIO_AF_1                       (0x0000001U) /*!< Select alternate function 1 */
#define LL_GPIO_AF_2                       (0x0000002U) /*!< Select alternate function 2 */
#define LL_GPIO_AF_3                       (0x0000003U) /*!< Select alternate function 3 */
#define LL_GPIO_AF_4                       (0x0000004U) /*!< Select alternate function 4 */
#define LL_GPIO_AF_5                       (0x0000005U) /*!< Select alternate function 5 */
#define LL_GPIO_AF_6                       (0x0000006U) /*!< Select alternate function 6 */
#define LL_GPIO_AF_7                       (0x0000007U) /*!< Select alternate function 7 */
#define LL_GPIO_AF_8                       (0x0000008U) /*!< Select alternate function 8 */
#define LL_GPIO_AF_9                       (0x0000009U) /*!< Select alternate function 9 */
#define LL_GPIO_AF_10                      (0x000000AU) /*!< Select alternate function 10 */
#define LL_GPIO_AF_11                      (0x000000BU) /*!< Select alternate function 11 */
#define LL_GPIO_AF_12                      (0x000000CU) /*!< Select alternate function 12 */
#define LL_GPIO_AF_13                      (0x000000DU) /*!< Select alternate function 13 */
#define LL_GPIO_AF_14                      (0x000000EU) /*!< Select alternate function 14 */
#define LL_GPIO_AF_15                      (0x000000FU) /*!< Select alternate function 15 */

/**
  * @}
  */

/** @defgroup GPIO_LL_Alternate_function_selection Alternate function selection
  * @{
  */

/**
  * @brief   AF 0 selection
  */

#define LL_GPIO_AF0_SWJ           LL_GPIO_AF_0   /*!< SWJ (SWD) Alternate Function mapping */
#define LL_GPIO_AF0_MCO           LL_GPIO_AF_0   /*!< MCO Alternate Function mapping */
#define LL_GPIO_AF0_TRACE         LL_GPIO_AF_0   /*!< TRACE Alternate Function mapping */

/**
  * @brief   AF 1 selection
  */
#define LL_GPIO_AF1_LPTIM1        LL_GPIO_AF_1   /*!< LPTIM1 Alternate Function mapping */
#define LL_GPIO_AF1_TIM2          LL_GPIO_AF_1   /*!< TIM2 Alternate Function mapping */
#define LL_GPIO_AF1_TIM5          LL_GPIO_AF_1   /*!< TIM5 Alternate Function mapping */
#define LL_GPIO_AF1_TIM14         LL_GPIO_AF_1   /*!< TIM14 Alternate Function mapping */
#define LL_GPIO_AF1_TIM15         LL_GPIO_AF_1   /*!< TIM15 Alternate Function mapping */
#define LL_GPIO_AF1_TIM16         LL_GPIO_AF_1   /*!< TIM16 Alternate Function mapping */
#define LL_GPIO_AF1_TIM17         LL_GPIO_AF_1   /*!< TIM17 Alternate Function mapping */

/**
  * @brief   AF 2 selection
  */
#define LL_GPIO_AF2_TIM1          LL_GPIO_AF_2   /*!< TIM1 Alternate Function mapping */
#define LL_GPIO_AF2_TIM2          LL_GPIO_AF_2   /*!< TIM2 Alternate Function mapping */
#define LL_GPIO_AF2_TIM3          LL_GPIO_AF_2   /*!< TIM3 Alternate Function mapping */
#define LL_GPIO_AF2_TIM4          LL_GPIO_AF_2   /*!< TIM4 Alternate Function mapping */
#define LL_GPIO_AF2_TIM5          LL_GPIO_AF_2   /*!< TIM5 Alternate Function mapping */
#define LL_GPIO_AF2_TIM8          LL_GPIO_AF_2   /*!< TIM8 Alternate Function mapping */
#define LL_GPIO_AF2_TIM9          LL_GPIO_AF_2   /*!< TIM9 Alternate Function mapping */
#define LL_GPIO_AF2_TIM15         LL_GPIO_AF_2   /*!< TIM15 Alternate Function mapping */
#define LL_GPIO_AF2_I2C3          LL_GPIO_AF_2   /*!< I2C3 Alternate Function mapping */

/**
  * @brief   AF 3 selection
  */
#define LL_GPIO_AF3_TIM8          LL_GPIO_AF_3   /*!< TIM8 Alternate Function mapping */
#define LL_GPIO_AF3_TIM9          LL_GPIO_AF_3   /*!< TIM9 Alternate Function mapping */
#define LL_GPIO_AF3_TIM10         LL_GPIO_AF_3   /*!< TIM10 Alternate Function mapping */
#define LL_GPIO_AF3_TIM11         LL_GPIO_AF_3   /*!< TIM11 Alternate Function mapping */
#define LL_GPIO_AF3_TIM12         LL_GPIO_AF_3   /*!< TIM12 Alternate Function mapping */
#define LL_GPIO_AF3_TIM13         LL_GPIO_AF_3   /*!< TIM13 Alternate Function mapping */
#define LL_GPIO_AF3_TIM14         LL_GPIO_AF_3   /*!< TIM14 Alternate Function mapping */
#define LL_GPIO_AF3_TIM15         LL_GPIO_AF_3   /*!< TIM15 Alternate Function mapping */
#define LL_GPIO_AF3_TIM18         LL_GPIO_AF_3   /*!< TIM18 Alternate Function mapping */
#define LL_GPIO_AF3_COMP3         LL_GPIO_AF_3   /*!< COMP3 Alternate Function mapping */
#define LL_GPIO_AF3_CTC           LL_GPIO_AF_3   /*!< CTC Alternate Function mapping */
#define LL_GPIO_AF3_I2C4          LL_GPIO_AF_3   /*!< I2C4 Alternate Function mapping */

/**
  * @brief   AF 4 selection
  */
#define LL_GPIO_AF4_TIM1          LL_GPIO_AF_4   /*!< TIM1 Alternate Function mapping*/
#define LL_GPIO_AF4_TIM8          LL_GPIO_AF_4   /*!< TIM8 Alternate Function mapping*/
#define LL_GPIO_AF4_TIM16         LL_GPIO_AF_4   /*!< TIM16 Alternate Function mapping*/
#define LL_GPIO_AF4_TIM17         LL_GPIO_AF_4   /*!< TIM17 Alternate Function mapping*/
#define LL_GPIO_AF4_TIM18         LL_GPIO_AF_4   /*!< TIM18 Alternate Function mapping*/
#define LL_GPIO_AF4_TIM19         LL_GPIO_AF_4   /*!< TIM19 Alternate Function mapping*/
#define LL_GPIO_AF4_I2C1          LL_GPIO_AF_4   /*!< I2C1 Alternate Function mapping*/
#define LL_GPIO_AF4_I2C2          LL_GPIO_AF_4   /*!< I2C2 Alternate Function mapping*/
#define LL_GPIO_AF4_I2C3          LL_GPIO_AF_4   /*!< I2C3 Alternate Function mapping*/
#define LL_GPIO_AF4_I2C4          LL_GPIO_AF_4   /*!< I2C4 Alternate Function mapping*/

/**
  * @brief   AF 5 selection
  */
#define LL_GPIO_AF5_TIM8          LL_GPIO_AF_5   /*!< TIM8 Alternate Function mapping*/
#define LL_GPIO_AF5_SPI1          LL_GPIO_AF_5   /*!< SPI1 Alternate Function mapping*/
#define LL_GPIO_AF5_SPI2          LL_GPIO_AF_5   /*!< SPI2 Alternate Function mapping*/
#define LL_GPIO_AF5_I2S1          LL_GPIO_AF_5   /*!< I2S1 Alternate Function mapping*/
#define LL_GPIO_AF5_I2S2          LL_GPIO_AF_5   /*!< I2S2 Alternate Function mapping*/
#define LL_GPIO_AF5_I2S3          LL_GPIO_AF_5   /*!< I2S3 Alternate Function mapping*/
#define LL_GPIO_AF5_IR            LL_GPIO_AF_5   /*!< IR Alternate Function mapping*/
#define LL_GPIO_AF5_UART1         LL_GPIO_AF_5   /*!< UART1 Alternate Function mapping*/
#define LL_GPIO_AF5_UART2         LL_GPIO_AF_5   /*!< UART2 Alternate Function mapping*/

/**
  * @brief   AF 6 selection
  */
#define LL_GPIO_AF6_TIM1          LL_GPIO_AF_6   /*!< TIM1 Alternate Function mapping */
#define LL_GPIO_AF6_TIM5          LL_GPIO_AF_6   /*!< TIM5 Alternate Function mapping */
#define LL_GPIO_AF6_TIM8          LL_GPIO_AF_6   /*!< TIM8 Alternate Function mapping */
#define LL_GPIO_AF6_SPI2          LL_GPIO_AF_6   /*!< SPI2 Alternate Function mapping */
#define LL_GPIO_AF6_SPI3          LL_GPIO_AF_6   /*!< SPI3 Alternate Function mapping */
#define LL_GPIO_AF6_I2S2          LL_GPIO_AF_6   /*!< I2S2 Alternate Function mapping */
#define LL_GPIO_AF6_I2S3          LL_GPIO_AF_6   /*!< I2S3 Alternate Function mapping */
#define LL_GPIO_AF6_LCDC          LL_GPIO_AF_6   /*!< LCDC Alternate Function mapping */
#define LL_GPIO_AF6_IR            LL_GPIO_AF_6   /*!< IR Alternate Function mapping */

/**
  * @brief   AF 7 selection
  */
#define LL_GPIO_AF7_TIM12          LL_GPIO_AF_7   /*!< TIM12 Alternate Function mapping */
#define LL_GPIO_AF7_USART1         LL_GPIO_AF_7   /*!< USART1 Alternate Function mapping */
#define LL_GPIO_AF7_USART2         LL_GPIO_AF_7   /*!< USART2 Alternate Function mapping */
#define LL_GPIO_AF7_USART3         LL_GPIO_AF_7   /*!< USART3 Alternate Function mapping */

/**
  * @brief   AF 8 selection
  */
#define LL_GPIO_AF8_TIM18          LL_GPIO_AF_8   /*!< TIM18 Alternate Function mapping*/
#define LL_GPIO_AF8_LPUART1        LL_GPIO_AF_8   /*!< LPUART1 Alternate Function mapping*/
#define LL_GPIO_AF8_COMP1          LL_GPIO_AF_8   /*!< COMP1 Alternate Function mapping*/
#define LL_GPIO_AF8_COMP2          LL_GPIO_AF_8   /*!< COMP2 Alternate Function mapping*/
#define LL_GPIO_AF8_COMP3          LL_GPIO_AF_8   /*!< COMP3 Alternate Function mapping*/
#define LL_GPIO_AF8_COMP4          LL_GPIO_AF_8   /*!< COMP4 Alternate Function mapping*/
#define LL_GPIO_AF8_I2C3           LL_GPIO_AF_8   /*!< I2C3 Alternate Function mapping*/
#define LL_GPIO_AF8_I2C4           LL_GPIO_AF_8   /*!< I2C4 Alternate Function mapping*/
#define LL_GPIO_AF8_CTC            LL_GPIO_AF_8   /*!< CTC Alternate Function mapping*/

/**
  * @brief   AF 9 selection
  */
#define LL_GPIO_AF9_TIM1           LL_GPIO_AF_9   /*!< TIM1 Alternate Function mapping*/
#define LL_GPIO_AF9_TIM8           LL_GPIO_AF_9   /*!< TIM8 Alternate Function mapping*/
#define LL_GPIO_AF9_TIM15          LL_GPIO_AF_9   /*!< TIM15 Alternate Function mapping*/
#define LL_GPIO_AF9_FDCAN1         LL_GPIO_AF_9   /*!< FDCAN1 Alternate Function mapping*/
#define LL_GPIO_AF9_FDCAN2         LL_GPIO_AF_9   /*!< FDCAN2 Alternate Function mapping*/
#define LL_GPIO_AF9_ESMC           LL_GPIO_AF_9   /*!< ESMC Alternate Function mapping*/

/**
  * @brief   AF 10 selection
  */
#define LL_GPIO_AF10_TIM2          LL_GPIO_AF_10  /*!< TIM2 Alternate Function mapping*/
#define LL_GPIO_AF10_TIM3          LL_GPIO_AF_10  /*!< TIM3 Alternate Function mapping*/
#define LL_GPIO_AF10_TIM4          LL_GPIO_AF_10  /*!< TIM4 Alternate Function mapping*/
#define LL_GPIO_AF10_TIM8          LL_GPIO_AF_10  /*!< TIM8 Alternate Function mapping*/
#define LL_GPIO_AF10_TIM17         LL_GPIO_AF_10  /*!< TIM17 Alternate Function mapping*/
#define LL_GPIO_AF10_ESMC          LL_GPIO_AF_10  /*!< ESMC Alternate Function mapping*/

/**
  * @brief   AF 11 selection
  */
#define LL_GPIO_AF11_LPTIM1        LL_GPIO_AF_11  /*!< LPTIM1 Alternate Function mapping*/
#define LL_GPIO_AF11_TIM1          LL_GPIO_AF_11  /*!< TIM1 Alternate Function mapping*/
#define LL_GPIO_AF11_TIM8          LL_GPIO_AF_11  /*!< TIM8 Alternate Function mapping*/
#define LL_GPIO_AF11_TIM19         LL_GPIO_AF_11  /*!< TIM19 Alternate Function mapping*/
#define LL_GPIO_AF11_SDIO          LL_GPIO_AF_11  /*!< SDIO Alternate Function mapping*/
#define LL_GPIO_AF11_LCDC          LL_GPIO_AF_11  /*!< LCDC Alternate Function mapping*/

/**
  * @brief   AF 12 selection
  */
#define LL_GPIO_AF12_TIM1          LL_GPIO_AF_12  /*!< TIM1 Alternate Function mapping*/
#define LL_GPIO_AF12_TIM11         LL_GPIO_AF_12  /*!< TIM11 Alternate Function mapping*/
#define LL_GPIO_AF12_LCDC          LL_GPIO_AF_12  /*!< LCDC Alternate Function mapping*/
#define LL_GPIO_AF12_LPUART1       LL_GPIO_AF_12  /*!< LPUART1 Alternate Function mapping*/

/**
  * @brief   AF 13 selection
  */
#define LL_GPIO_AF13_TIM19         LL_GPIO_AF_13  /*!< TIM19 Alternate Function mapping*/
#define LL_GPIO_AF13_ETH           LL_GPIO_AF_13  /*!< ETH Alternate Function mapping*/
#define LL_GPIO_AF13_LCDC          LL_GPIO_AF_13  /*!< LCDC Alternate Function mapping*/

/**
  * @brief   AF 14 selection
  */
#define LL_GPIO_AF14_TIM2          LL_GPIO_AF_14  /*!< TIM2 Alternate Function mapping*/
#define LL_GPIO_AF14_UART3         LL_GPIO_AF_14  /*!< UART3 Alternate Function mapping*/
#define LL_GPIO_AF14_USB1          LL_GPIO_AF_14  /*!< USB1 Alternate Function mapping*/
#define LL_GPIO_AF14_USB2          LL_GPIO_AF_14  /*!< USB2 Alternate Function mapping*/

/**
  * @brief   AF 15 selection
  */
#define LL_GPIO_AF15_EVENT         LL_GPIO_AF_15  /*!< EVENT Alternate Function mapping*/

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup GPIO_LL_Exported_Macros GPIO Exported Macros
  * @{
  */

/** @defgroup GPIO_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in GPIO register
  * @param  __INSTANCE__ GPIO Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_GPIO_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in GPIO register
  * @param  __INSTANCE__ GPIO Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_GPIO_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup GPIO_LL_Exported_Functions GPIO Exported Functions
  * @{
  */

/** @defgroup GPIO_LL_EF_Port_Configuration Port Configuration
  * @{
  */

/**
  * @brief  Configure gpio mode for a dedicated pin on dedicated port.
  * @note   I/O mode can be Input mode, General purpose output, Alternate function mode or Analog.
  * @note   Warning: only one pin can be passed as parameter.
  * @rmtoll MODER        MODEy         LL_GPIO_SetPinMode
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  * @param  Mode This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_MODE_INPUT
  *         @arg @ref LL_GPIO_MODE_OUTPUT
  *         @arg @ref LL_GPIO_MODE_ALTERNATE
  *         @arg @ref LL_GPIO_MODE_ANALOG
  * @retval None
  */
__STATIC_INLINE void LL_GPIO_SetPinMode(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t Mode)
{
  MODIFY_REG(GPIOx->MODER, ((Pin * Pin) * GPIO_MODER_MODE0), ((Pin * Pin) * Mode));
}

/**
  * @brief  Return gpio mode for a dedicated pin on dedicated port.
  * @note   I/O mode can be Input mode, General purpose output, Alternate function mode or Analog.
  * @note   Warning: only one pin can be passed as parameter.
  * @rmtoll MODER        MODEy         LL_GPIO_GetPinMode
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GPIO_MODE_INPUT
  *         @arg @ref LL_GPIO_MODE_OUTPUT
  *         @arg @ref LL_GPIO_MODE_ALTERNATE
  *         @arg @ref LL_GPIO_MODE_ANALOG
  */
__STATIC_INLINE uint32_t LL_GPIO_GetPinMode(GPIO_TypeDef *GPIOx, uint32_t Pin)
{
  return (uint32_t)(READ_BIT(GPIOx->MODER, ((Pin * Pin) * GPIO_MODER_MODE0)) / (Pin * Pin));
}

/**
  * @brief  Configure gpio output type for several pins on dedicated port.
  * @note   Output type as to be set when gpio pin is in output or
  *         alternate modes. Possible type are Push-pull or Open-drain.
  * @rmtoll OTYPER       OTy           LL_GPIO_SetPinOutputType
  * @param  GPIOx GPIO Port
  * @param  PinMask This parameter can be a combination of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  *         @arg @ref LL_GPIO_PIN_ALL
  * @param  OutputType This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_OUTPUT_PUSHPULL
  *         @arg @ref LL_GPIO_OUTPUT_OPENDRAIN
  * @retval None
  */
__STATIC_INLINE void LL_GPIO_SetPinOutputType(GPIO_TypeDef *GPIOx, uint32_t PinMask, uint32_t OutputType)
{
  MODIFY_REG(GPIOx->OTYPER, PinMask, (PinMask * OutputType));
}

/**
  * @brief  Return gpio output type for several pins on dedicated port.
  * @note   Output type as to be set when gpio pin is in output or
  *         alternate modes. Possible type are Push-pull or Open-drain.
  * @note   Warning: only one pin can be passed as parameter.
  * @rmtoll OTYPER       OTy           LL_GPIO_GetPinOutputType
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  *         @arg @ref LL_GPIO_PIN_ALL
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GPIO_OUTPUT_PUSHPULL
  *         @arg @ref LL_GPIO_OUTPUT_OPENDRAIN
  */
__STATIC_INLINE uint32_t LL_GPIO_GetPinOutputType(GPIO_TypeDef *GPIOx, uint32_t Pin)
{
  return (uint32_t)(READ_BIT(GPIOx->OTYPER, Pin) / Pin);
}

/**
  * @brief  Configure gpio speed for a dedicated pin on dedicated port.
  * @note   I/O speed can be Low, Medium, High or Very High speed.
  * @note   Warning: only one pin can be passed as parameter.
  * @note   Refer to datasheet for frequency specifications and the power
  *         supply and load conditions for each speed.
  * @rmtoll OSPEEDR      OSPEEDy       LL_GPIO_SetPinSpeed
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  * @param  Speed This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_SPEED_FREQ_LOW
  *         @arg @ref LL_GPIO_SPEED_FREQ_MEDIUM
  *         @arg @ref LL_GPIO_SPEED_FREQ_HIGH
  *         @arg @ref LL_GPIO_SPEED_FREQ_VERY_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_GPIO_SetPinSpeed(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t  Speed)
{
  MODIFY_REG(GPIOx->OSPEEDR, ((Pin * Pin) * GPIO_OSPEEDR_OSPEED0), ((Pin * Pin) * Speed));
}

/**
  * @brief  Return gpio speed for a dedicated pin on dedicated port.
  * @note   I/O speed can be Low, Medium, High or Very High speed.
  * @note   Warning: only one pin can be passed as parameter.
  * @note   Refer to datasheet for frequency specifications and the power
  *         supply and load conditions for each speed.
  * @rmtoll OSPEEDR      OSPEEDy       LL_GPIO_GetPinSpeed
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GPIO_SPEED_FREQ_LOW
  *         @arg @ref LL_GPIO_SPEED_FREQ_MEDIUM
  *         @arg @ref LL_GPIO_SPEED_FREQ_HIGH
  *         @arg @ref LL_GPIO_SPEED_FREQ_VERY_HIGH
  */
__STATIC_INLINE uint32_t LL_GPIO_GetPinSpeed(GPIO_TypeDef *GPIOx, uint32_t Pin)
{
  return (uint32_t)(READ_BIT(GPIOx->OSPEEDR, ((Pin * Pin) * GPIO_OSPEEDR_OSPEED0)) / (Pin * Pin));
}

/**
  * @brief  Configure gpio pull-up or pull-down for a dedicated pin on a dedicated port.
  * @note   Warning: only one pin can be passed as parameter.
  * @rmtoll PUPDR        PUPDy         LL_GPIO_SetPinPull
  * @param  GPIOx GPIO Port
  * @param  Pin This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PIN_0
  *         @arg @ref LL_GPIO_PIN_1
  *         @arg @ref LL_GPIO_PIN_2
  *         @arg @ref LL_GPIO_PIN_3
  *         @arg @ref LL_GPIO_PIN_4
  *         @arg @ref LL_GPIO_PIN_5
  *         @arg @ref LL_GPIO_PIN_6
  *         @arg @ref LL_GPIO_PIN_7
  *         @arg @ref LL_GPIO_PIN_8
  *         @arg @ref LL_GPIO_PIN_9
  *         @arg @ref LL_GPIO_PIN_10
  *         @arg @ref LL_GPIO_PIN_11
  *         @arg @ref LL_GPIO_PIN_12
  *         @arg @ref LL_GPIO_PIN_13
  *         @arg @ref LL_GPIO_PIN_14
  *         @arg @ref LL_GPIO_PIN_15
  * @param  Pull This parameter can be one of the following values:
  *         @arg @ref LL_GPIO_PULL_NO
  *         @arg @ref LL_GPIO_PULL_UP
  *         @arg @ref LL_GPIO_PULL_DOWN
  * @retval None
  */
__STATIC_INLINE void LL_GPIO_SetPinPull(GPIO_TypeDef *GPIOx, uint32_t Pin, uint32_t Pull)
{
  MODIFY_REG(GPIOx->PUPDR, ((Pin * Pin) * GPIO_PUPDR_PUPD0), ((Pin * Pin) * Pull));
}

